---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.TextFailures
source: html/ddf94a6b-971f-2faa-7503-79ae68363984.htm
---
# BuiltInFailures.TextFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.